# ThermalAsset Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ThermalAsset Class
Members See Also
---
Represents the properties of a material pertinent to energy analysis.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class ThermalAsset : IDisposable
```

Visual Basic
---
```text
Public Class ThermalAsset _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ThermalAsset : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ThermalAsset
# See Also
ThermalAsset Members
Autodesk.Revit.DB Namespace